In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
%cd '/content/drive/My Drive/Colab Notebooks/db'
!ls

/content/drive/My Drive/Colab Notebooks/db
API_19_DS2_en_csv_v2_1926515.csv		 groups_sitc_rev2.csv
API_AG.LND.AGRI.K2_DS2_en_csv_v2_1927122.csv	 london_merged.csv
API_AG.LND.FRST.K2_DS2_en_csv_v2_1927168.csv	 Meteorite_Landings.csv
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_1927784.csv  poblacion.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_1926651.csv	 products.json
API_SP.POP.TOTL_DS2_en_csv_v2_1976634.csv	 products_sitc_rev2.csv
colombia_exports.csv				 test.csv
colombia_imports.csv				 text.hdf
cotizacion.csv					 text.json
country_names.csv				 text.parquet
covid_19_data.csv				 text.pkl
diabetes.csv					 text.xlsx
fake-company.csv				 titanic.csv
GlobalLandTemperaturesByCountry.csv		 year_origin_sitc_rev2.tsv
goog-1.csv

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('cotizacion.csv', sep = ";",decimal=',')

In [ ]:
df_cotizacion = df.copy(deep=True)

In [ ]:
df_cotizacion.head()

     Nombre    Final   Máximo   Mínimo  Volumen  Efectivo
0   ACCIONA    95.95    96.75    94.40   84.962   8166.11
1  ACERINOX  8668.00  8672.00  8468.00   885.99   7633.81
2       ACS    37.28    37.66    37.22  655.982  24517.29
3      AENA   167.10   167.50   166.10  133.738  22336.10
4   AMADEUS    69.96    70.64    69.56  640.476  44795.47

In [ ]:
df_cotizacion.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    35 non-null     object
 1   Final     35 non-null     float64
 2   Máximo    35 non-null     float64
 3   Mínimo    35 non-null     float64
 4   Volumen   35 non-null     object
 5   Efectivo  35 non-null     float64
dtypes: float64(4), object(2)
memory usage: 1.8+ KB

In [ ]:
df_cotizacion['Volumen']=df_cotizacion['Volumen'].apply(columnVolumn).astype(float)

In [ ]:
def columnVolumn(x):  
  y = x.split('.')
  if len(x.split('.')) > 2:
    return y[0]+y[1]+'.'+y[2]
  else:
    return y[0] + '.'+y[1]

In [ ]:
df_cotizacion.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    35 non-null     object
 1   Final     35 non-null     float64
 2   Máximo    35 non-null     float64
 3   Mínimo    35 non-null     float64
 4   Volumen   35 non-null     float64
 5   Efectivo  35 non-null     float64
dtypes: float64(5), object(1)
memory usage: 1.8+ KB

In [ ]:
df_cotizacion.describe()

              Final        Máximo        Mínimo       Volumen       Efectivo
count     35.000000     35.000000     35.000000     35.000000      35.000000
mean    2796.768757   3170.113357   3136.510471   4324.351029   31767.778000
std     5007.267143   5160.834249   4804.485259   7864.205244   38100.607064
min        1.016500      4.067500      1.016500     67.710000    2343.090000
25%       17.970000     23.115000     22.700000    663.867500    8114.620000
50%       30.170000     49.120000     48.460000   1236.799000   16787.550000
75%     3322.500000   5283.000000   5869.000000   2836.005500   40447.635000
max    19705.000000  19875.000000  19675.000000  36129.692000  145765.440000